УчетВУправляющихДляГит1/src/DataProcessors/ПанельОбменСЕГАИС/ПанельОбменСЕГАИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПанельОбменСЕГАИС</name>
</mdclass:DataProcessor>

УчетВУправляющихДляГит1/src/InformationRegisters/ОчередьПередачиДанныхЕГАИС/ОчередьПередачиДанныхЕГАИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередьПередачиДанныхЕГАИС</name>
  <resources>
    <name>ОрганизацияЕГАИС</name>
    <type>
      <types>CatalogRef.КлассификаторОрганизацийЕГАИС</types>
    </type>
  </resources>
  <dimensions>
    <name>Сообщение</name>
    <type>
      <types>CatalogRef.ЕГАИСПрисоединенныеФайлы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УчетВУправляющихДляГит1/src/InformationRegisters/НастройкиОбменаЕГАИС/НастройкиОбменаЕГАИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиОбменаЕГАИС</name>
  <resources>
    <name>АдресУТМ</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ПортУТМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Таймаут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбменНаСервере</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗагружатьВходящиеДокументы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОбменНаКлиентеРасписание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ОбменНаКлиентеПоРасписанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьРесурсОрганизация</name>
    <type>
      <types>DefinedType.ОрганизацияКонтрагентГосИС</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьРесурсСклад</name>
    <type>
      <types>DefinedType.ТорговыйОбъектЕГАИС</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьОрганизацияЕГАИС</name>
    <type>
      <types>CatalogRef.КлассификаторОрганизацийЕГАИС</types>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторФСРАР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>РабочееМесто</name>
    <type>
      <types>DefinedType.РабочиеМестаИС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьИзмерениеОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьИзмерениеСклад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УчетВУправляющихДляГит1/src/Enums/ВидыДокументовЕГАИС/ВидыДокументовЕГАИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДокументовЕГАИС</name>
  <enumValues>
    <name>АктТТН</name>
  </enumValues>
  <enumValues>
    <name>АктТТНОтказ</name>
  </enumValues>
  <enumValues>
    <name>АктТТНПодтверждение</name>
  </enumValues>
  <enumValues>
    <name>АктПостановкиНаБалансВРегистр1</name>
  </enumValues>
  <enumValues>
    <name>АктПостановкиНаБалансВРегистр2</name>
  </enumValues>
  <enumValues>
    <name>АктПостановкиНаБалансВРегистр3</name>
  </enumValues>
  <enumValues>
    <name>АктТТНРасхождения</name>
  </enumValues>
  <enumValues>
    <name>АктСписанияИзРегистра1</name>
  </enumValues>
  <enumValues>
    <name>АктСписанияИзРегистра2</name>
  </enumValues>
  <enumValues>
    <name>АктСписанияИзРегистра3</name>
  </enumValues>
  <enumValues>
    <name>ВозвратИзРегистра2</name>
  </enumValues>
  <enumValues>
    <name>ЗапросАлкогольнойПродукции</name>
  </enumValues>
  <enumValues>
    <name>ЗапросНаОтменуПроведенияАктаПостановкиНаБаланс</name>
  </enumValues>
  <enumValues>
    <name>ЗапросНаОтменуПроведенияАктаСписания</name>
  </enumValues>
  <enumValues>
    <name>ЗапросНаОтменуПроведенияТТН</name>
  </enumValues>
  <enumValues>
    <name>ЗапросДанныхОрганизации</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОстатковВРегистре1</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОстатковВРегистре2</name>
  </enumValues>
  <enumValues>
    <name>ЗапросСправки1</name>
  </enumValues>
  <enumValues>
    <name>ЗапросСправки2</name>
  </enumValues>
  <enumValues>
    <name>ЗапросТТН</name>
  </enumValues>
  <enumValues>
    <name>ИнформацияОФорматеОбмена</name>
  </enumValues>
  <enumValues>
    <name>КвитанцияПроведенЕГАИС</name>
  </enumValues>
  <enumValues>
    <name>КвитанцияПолученЕГАИС</name>
  </enumValues>
  <enumValues>
    <name>ЗапросАкцизныхМарок</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросАкцизныхМарок</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросАлкогольнойПродукции</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросДанныхОрганизации</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОстатковВРегистре1</name>
  </enumValues>
  <enumValues>
    <name>КвитанцияЗапросаНаОтменуПроведенияТТН</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОстатковВРегистре2</name>
  </enumValues>
  <enumValues>
    <name>КвитанцияАктаРасхожденийОтказ</name>
  </enumValues>
  <enumValues>
    <name>Квитанция</name>
  </enumValues>
  <enumValues>
    <name>КвитанцияЗапросаНаОтменуПроведенияТТНОтказ</name>
  </enumValues>
  <enumValues>
    <name>ПередачаВРегистр2</name>
  </enumValues>
  <enumValues>
    <name>КвитанцияАктаРасхождений</name>
  </enumValues>
  <enumValues>
    <name>КвитанцияАктаРасхожденийПодтверждение</name>
  </enumValues>
  <enumValues>
    <name>КвитанцияЗапросаНаОтменуПроведенияТТНПодтверждение</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОРегистрацииДвиженияТТН</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОРегистрацииДвиженияАктаПостановкиНаБаланс</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаДвиженияМеждуРегистрами</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаДвиженияПоСправке2</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаИнформацияОбОрганизации</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаНеобработанныеТТН</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаОбработанныеЧеки</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаОстаткиВРегистре1</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаОстаткиВРегистре2</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаОстаткиВРегистре3</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаДвиженияМеждуРегистрами</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаДвиженияПоСправке2</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаИнформацияОбОрганизации</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаНеобработанныеТТН</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаОбработанныеЧеки</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаОстаткиВРегистре1</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаОстаткиВРегистре2</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаОстаткиВРегистре3</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросСправки1</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросСправки2</name>
  </enumValues>
  <enumValues>
    <name>ТТН</name>
  </enumValues>
  <enumValues>
    <name>ЧекККМ</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОтчетаИсторияСправок2</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросОтчетаИсторияСправок2</name>
  </enumValues>
  <enumValues>
    <name>ИсторияСправок2ПоТТН</name>
  </enumValues>
  <enumValues>
    <name>ЧекККМОтменаПередачи</name>
  </enumValues>
  <enumValues>
    <name>ЗапросПроверкиАкцизныхМарокНаОстаткахОрганизации</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗапросПроверкиАкцизныхМарокНаОстаткахОрганизации</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/Documents/АктПостановкиНаБалансЕГАИС/АктПостановкиНаБалансЕГАИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АктПостановкиНаБалансЕГАИС</name>
  <registerRecords>AccumulationRegister.ОстаткиАлкогольнойПродукцииЕГАИС</registerRecords>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>EnumRef.ВидыДокументовЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияЕГАИС</name>
    <type>
      <types>CatalogRef.КлассификаторОрганизацийЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЕГАИС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСтатусОбработки</name>
    <type>
      <types>EnumRef.СтатусыОбработкиАктаПостановкиНаБалансЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаПостановкиНаБаланс</name>
    <type>
      <types>EnumRef.ПричиныПостановкиНаБалансЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ОснованиеАктаПостановкиНаБалансЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>DefinedType.ПользователиИС</types>
    </type>
  </attributes>
  <attributes>
    <name>АктСписанияЕГАИС</name>
    <type>
      <types>DocumentRef.АктСписанияЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрацииДвижений</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеПроверкиИПодбора</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПроверкиИПодбора</name>
    <type>
      <types>EnumRef.СтатусыПроверкиИПодбораИС</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>АлкогольнаяПродукция</name>
      <type>
        <types>CatalogRef.КлассификаторАлкогольнойПродукцииЕГАИС</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.ХарактеристикаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>DefinedType.СерияНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>DefinedType.Упаковка</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПоСправке1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТТН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаТТН</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРозлива</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПодтвержденияЕГАИС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПодтвержденияЕГАИС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Справка2</name>
      <type>
        <types>CatalogRef.Справки2ЕГАИС</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьСправка1</name>
      <type>
        <types>CatalogRef.Справки1ЕГАИС</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>АкцизныеМарки</name>
    <attributes>
      <name>КодАкцизнойМарки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>68</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АкцизнаяМарка</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>Справка2</name>
      <type>
        <types>CatalogRef.Справки2ЕГАИС</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УчетВУправляющихДляГит1/src/DataProcessors/ПанельОбменСЕГАИС/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ПараметрыПодключенияКЕГАИС.Видимость             = ПравоДоступа("Чтение", Метаданные.РегистрыСведений.НастройкиОбменаЕГАИС);
	Элементы.КлассификаторАлкогольнойПродукцииЕГАИС.Видимость = ПравоДоступа("Чтение", Метаданные.Справочники.КлассификаторАлкогольнойПродукцииЕГАИС);
	Элементы.КлассификаторОрганизацийЕГАИС.Видимость          = ПравоДоступа("Чтение", Метаданные.Справочники.КлассификаторОрганизацийЕГАИС);
	Элементы.Справки1ЕГАИС.Видимость                          = ПравоДоступа("Чтение", Метаданные.Справочники.Справки1ЕГАИС);
	Элементы.Справки2ЕГАИС.Видимость                          = ПравоДоступа("Чтение", Метаданные.Справочники.Справки2ЕГАИС);
	Элементы.ГруппаПомощникКорректировкиОстатков.Видимость    = ПравоДоступа("Использование", Метаданные.Обработки.ПомощникКорректировкиОстатковЕГАИС);
	
	ИнтеграцияЕГАИС.УстановитьВидимостьКомандыВыполнитьОбмен(ЭтотОбъект, "ФормаВыполнитьОбмен");
	
	ВосстановитьНастройкиФормы();
	ОбновитьСпискиДокументов();
	
	Если ОбщегоНазначения.РежимОтладки() Тогда
		Элементы.ОткрытьНастройкиРежимаОтладки.Видимость = Истина;
		Элементы.ИзменитьФорму.ТолькоВоВсехДействиях = Истина;
	КонецЕсли;
	
	СобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	СобытияФормИСКлиентПереопределяемый.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НадписьСообщенияОжидающиеОтправкиНажатие(Элемент)
	
	Если ОрганизацииЕГАИС.Количество() > 0 Тогда
		
		Отбор = Новый Структура;
		Отбор.Вставить("ОрганизацияЕГАИС", ОрганизацииЕГАИС.ВыгрузитьЗначения());
		
		ПараметрыОткрытияФормы = Новый Структура;
		ПараметрыОткрытияФормы.Вставить("Отбор", Отбор);
		
	Иначе
		
		ПараметрыОткрытияФормы = Неопределено;
		
	КонецЕсли;
	
	ОткрытьФорму(
		"РегистрСведений.ОчередьПередачиДанныхЕГАИС.ФормаСписка",
		ПараметрыОткрытияФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйПриИзменении(Элемент)
	
	ОбновитьСпискиДокументов();
	
КонецПроцедуры

#Область ОтборПоОрганизацииЕГАИС

&НаКлиенте
Процедура ОтборОрганизацииЕГАИСПриИзменении(Элемент)
	
	Элементы.ОткрытьWebИнтерфейсУТМ.Видимость = ЗначениеЗаполнено(ОрганизацииЕГАИС);
	
	ИнтеграцияЕГАИСКлиент.ОбработатьВыборОрганизацийЕГАИС(
		ЭтотОбъект, ОрганизацииЕГАИС, Ложь, "Отбор",
		ИнтеграцияЕГАИСКлиент.ОтборОрганизацияЕГАИСПрефиксы());
	
	ОбновитьСпискиДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацииЕГАИСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИнтеграцияЕГАИСКлиент.ОткрытьФормуВыбораОрганизацийЕГАИС(
		ЭтотОбъект, "Отбор",
		ИнтеграцияЕГАИСКлиент.ОтборОрганизацияЕГАИСПрефиксы(),
		Новый ОписаниеОповещения("ПослеВыбораОрганизацииЕГАИС", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацииЕГАИСОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИнтеграцияЕГАИСКлиент.ОбработатьВыборОрганизацийЕГАИС(
		ЭтотОбъект, Неопределено, Ложь, "Отбор",
		ИнтеграцияЕГАИСКлиент.ОтборОрганизацияЕГАИСПрефиксы());
	
	ОбновитьСпискиДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацииЕГАИСОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИнтеграцияЕГАИСКлиент.ОбработатьВыборОрганизацийЕГАИС(
		ЭтотОбъект, ВыбранноеЗначение, Ложь, "Отбор",
		ИнтеграцияЕГАИСКлиент.ОтборОрганизацияЕГАИСПрефиксы());
	
	ОбновитьСпискиДокументов();
	
КонецПроцедуры


&НаКлиенте
Процедура ОтборОрганизацияЕГАИСПриИзменении(Элемент)
	
	ИнтеграцияЕГАИСКлиент.ОбработатьВыборОрганизацийЕГАИС(
		ЭтотОбъект, ОрганизацияЕГАИС, Ложь, "Отбор",
		ИнтеграцияЕГАИСКлиент.ОтборОрганизацияЕГАИСПрефиксы());
	
	ОбновитьСпискиДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияЕГАИСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИнтеграцияЕГАИСКлиент.ОткрытьФормуВыбораОрганизацийЕГАИС(
		ЭтотОбъект,
		"Отбор",
		ИнтеграцияЕГАИСКлиент.ОтборОрганизацияЕГАИСПрефиксы(),
		Новый ОписаниеОповещения("ПослеВыбораОрганизацииЕГАИС", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияЕГАИСОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИнтеграцияЕГАИСКлиент.ОбработатьВыборОрганизацийЕГАИС(
		ЭтотОбъект, Неопределено, Ложь, "Отбор",
		ИнтеграцияЕГАИСКлиент.ОтборОрганизацияЕГАИСПрефиксы());
	
	ОбновитьСпискиДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияЕГАИСОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИнтеграцияЕГАИСКлиент.ОбработатьВыборОрганизацийЕГАИС(
		ЭтотОбъект, ВыбранноеЗначение, Ложь, "Отбор",
		ИнтеграцияЕГАИСКлиент.ОтборОрганизацияЕГАИСПрефиксы());
	
	ОбновитьСпискиДокументов();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПараметрыПодключенияКЕГАИС(Команда)
	
	ОткрытьФорму("РегистрСведений.НастройкиОбменаЕГАИС.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КлассификаторАлкогольнойПродукцииЕГАИС(Команда)
	
	ОткрытьФорму("Справочник.КлассификаторАлкогольнойПродукцииЕГАИС.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыАлкогольнойПродукции(Команда)
	
	ОткрытьФорму("Справочник.ВидыАлкогольнойПродукции.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КлассификаторОрганизацийЕГАИС(Команда)
	
	ОткрытьФорму("Справочник.КлассификаторОрганизацийЕГАИС.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Справки1ЕГАИС(Команда)
	
	ОткрытьФорму("Справочник.Справки1ЕГАИС.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Справки2ЕГАИС(Команда)
	
	ОткрытьФорму("Справочник.Справки2ЕГАИС.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ШтрихкодыУпаковок(Команда)
	
	ОткрытьФорму("Справочник.ШтрихкодыУпаковокТоваров.ФормаСписка", , ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПросмотрВходящихСообщенийУТМ(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Обработка.ВходящиеСообщенияУТМЕГАИС.Форма.Форма");
	
КонецПроцедуры

#Область ТТНВходщиеЕГАИС

&НаКлиенте
Процедура ОткрытьТТНВходящаяЕГАИС(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ТТНВходящаяЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТТНВходящаяЕГАИСОтработайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ТТНВходящаяЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТТНВходящаяЕГАИСОжидайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ТТНВходящаяЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры

#КонецОбласти

#Область ТТНИсходящаяЕГАИС

&НаКлиенте
Процедура ОткрытьТТНИсходящаяЕГАИС(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ТТНИсходящаяЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТТНИсходящаяЕГАИСОформите(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ТТНИсходящаяЕГАИС.Форма.ФормаСпискаДокументов",
		Неопределено,
		Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТТНИсходящаяЕГАИСОтработайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ТТНИсходящаяЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТТНИсходящаяЕГАИСОжидайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ТТНИсходящаяЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры

#КонецОбласти

#Область АктПостановкиНаБалансЕГАИС

&НаКлиенте
Процедура ОткрытьАктПостановкиНаБалансЕГАИС(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.АктПостановкиНаБалансЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАктПостановкиНаБалансЕГАИСОформите(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.АктПостановкиНаБалансЕГАИС.Форма.ФормаСпискаДокументов",
		Неопределено,
		Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАктПостановкиНаБалансЕГАИСОтработайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.АктПостановкиНаБалансЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАктПостановкиНаБалансЕГАИСОжидайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.АктПостановкиНаБалансЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры

#КонецОбласти

#Область АктСписанияЕГАИС

&НаКлиенте
Процедура ОткрытьАктСписанияЕГАИС(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.АктСписанияЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАктСписанияЕГАИСОформите(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.АктСписанияЕГАИС.Форма.ФормаСпискаДокументов",
		Неопределено,
		Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАктСписанияЕГАИСОтработайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.АктСписанияЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАктСписанияЕГАИСОжидайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.АктСписанияЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры

#КонецОбласти

#Область ПередачаВРегистр2ЕГАИС

&НаКлиенте
Процедура ОткрытьПередачаВРегистр2ЕГАИС(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ПередачаВРегистр2ЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПередачаВРегистр2ЕГАИСОформите(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ПередачаВРегистр2ЕГАИС.Форма.ФормаСпискаДокументов",
		Неопределено,
		Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПередачаВРегистр2ЕГАИСОтработайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ПередачаВРегистр2ЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПередачаВРегистр2ЕГАИСОжидайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ПередачаВРегистр2ЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры

#КонецОбласти

#Область ВозвратИзРегистра2ЕГАИС

&НаКлиенте
Процедура ОткрытьВозвратИзРегистра2ЕГАИС(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ВозвратИзРегистра2ЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВозвратИзРегистра2ЕГАИСОформите(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ВозвратИзРегистра2ЕГАИС.Форма.ФормаСпискаДокументов",
		Неопределено,
		Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВозвратИзРегистра2ЕГАИСОтработайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ВозвратИзРегистра2ЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВозвратИзРегистра2ЕГАИСОжидайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ВозвратИзРегистра2ЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры

#КонецОбласти

#Область ЧекЕГАИС

&НаКлиенте
Процедура ОткрытьЧекЕГАИС(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ЧекЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЧекЕГАИСОформите(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ЧекЕГАИС.Форма.ФормаСпискаДокументов",
		Неопределено,
		Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЧекЕГАИСОтработайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ЧекЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЧекЕГАИСОжидайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ЧекЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры

#КонецОбласти

#Область ЧекЕГАИСВозврат

&НаКлиенте
Процедура ОткрытьЧекЕГАИСВозврат(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ЧекЕГАИСВозврат.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЧекЕГАИСВозвратОформите(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ЧекЕГАИСВозврат.Форма.ФормаСпискаДокументов",
		Неопределено,
		Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЧекЕГАИСВозвратОтработайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ЧекЕГАИСВозврат.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЧекЕГАИСВозвратОжидайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ЧекЕГАИСВозврат.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры

#КонецОбласти

#Область ОстаткиЕГАИС

&НаКлиенте
Процедура ОткрытьОстаткиЕГАИС(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ОстаткиЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОстаткиЕГАИСОтработайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ОстаткиЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОстаткиЕГАИСОжидайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ОстаткиЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры

#КонецОбласти

#Область ЗапросыАкцизныхМарокЕГАИС

&НаКлиенте
Процедура ОткрытьЗапросыАкцизныхМарокЕГАИС(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ЗапросАкцизныхМарокЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗапросыАкцизныхМарокЕГАИСОтработайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ЗапросАкцизныхМарокЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗапросыАкцизныхМарокЕГАИСОжидайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ЗапросАкцизныхМарокЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры

#КонецОбласти

#Область ОтчетыЕГАИС

&НаКлиенте
Процедура ОткрытьОтчетЕГАИС(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ОтчетЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействияИлиОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетЕГАИСОтработайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ОтчетЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеДействия");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетЕГАИСОжидайте(Команда)
	
	ОткрытьФормуСпискаДокументов(
		"Документ.ОтчетЕГАИС.Форма.ФормаСпискаДокументов",
		"ВсеТребующиеОжидания");
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ОткрытьПомощникКорректировкиОстатков(Команда)
	
	ПараметрыОткрытия = Новый Структура("Организация", ОрганизацияЕГАИС);
	ОткрытьФорму("Обработка.ПомощникКорректировкиОстатковЕГАИС.Форма.Форма", ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПротоколОбменаЕГАИС(Команда)
	
	ОткрытьФорму("Справочник.ЕГАИСПрисоединенныеФайлы.Форма.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьСпискиДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбмен(Команда)
	
	ИнтеграцияЕГАИСКлиент.ВыполнитьОбмен(
		ИнтеграцияЕГАИСКлиент.ОрганизацииЕГАИСДляОбмена(
			ЭтотОбъект),,
		ЭтотОбъект.УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьWebИнтерфейсУТМ(Команда)
	
	ОчиститьСообщения();
	
	Если ОрганизацииЕГАИС.Количество() = 0 Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Не заполнено поле ""Организация ЕГАИС""'"),,
			"ОрганизацияЕГАИС");
		
	ИначеЕсли ОрганизацииЕГАИС.Количество() = 1 Тогда
		
		ВыполнитьОткрытьWebИнтерфейсУТМ(ОрганизацияЕГАИС);
		
	ИначеЕсли ОрганизацииЕГАИС.Количество() > 1 Тогда
		
		ОрганизацииЕГАИС.ПоказатьВыборЭлемента(
			Новый ОписаниеОповещения(
				"ОбработатьВыборОрганизацииЕГАИСДляОткрытияWebИнтерфейсаУТМ", ЭтотОбъект),
				НСтр("ru = 'Выбор организации ЕГАИС'"),
				ОрганизацииЕГАИС.Получить(0).Значение);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьАкцизныеМаркиНаОстаткахОрганизации(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Операция", ПредопределенноеЗначение("Перечисление.ВидыДокументовЕГАИС.ЗапросПроверкиАкцизныхМарокНаОстаткахОрганизации"));
	
	ОткрытьФорму(
		"ОбщаяФорма.ФормированиеИсходящегоЗапросаЕГАИС",
		ПараметрыФормы,,,,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиРежимаОтладки(Команда)
	
	ОткрытьФорму("Обработка.ПанельОбменСЕГАИС.Форма.НастройкиРежимаОтладки");
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормИСКлиентПереопределяемый.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеОткрытияWebИнтерфейсаУТМ(Результат, ДополнительныеПараметры) Экспорт
	Возврат;
КонецПроцедуры

&НаСервереБезКонтекста
Функция АдресИПортУТМ(ОрганизацияЕГАИС)
	
	ВозвращаемоеЗначение = Неопределено;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	НастройкиОбменаЕГАИС.АдресУТМ КАК АдресУТМ,
	|	НастройкиОбменаЕГАИС.ПортУТМ КАК ПортУТМ
	|ИЗ
	|	РегистрСведений.НастройкиОбменаЕГАИС КАК НастройкиОбменаЕГАИС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлассификаторОрганизацийЕГАИС КАК КлассификаторОрганизацийЕГАИС
	|		ПО НастройкиОбменаЕГАИС.ИдентификаторФСРАР = КлассификаторОрганизацийЕГАИС.Код
	|		И КлассификаторОрганизацийЕГАИС.Ссылка = &ОрганизацияЕГАИС
	|ГДЕ
	|	НастройкиОбменаЕГАИС.РабочееМесто = &РабочееМесто
	|	ИЛИ НастройкиОбменаЕГАИС.РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМеста.ПустаяСсылка)");
	
	Запрос.УстановитьПараметр("РабочееМесто",     МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента());
	Запрос.УстановитьПараметр("ОрганизацияЕГАИС", ОрганизацияЕГАИС);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		ВозвращаемоеЗначение = Новый Структура;
		ВозвращаемоеЗначение.Вставить("АдресУТМ", Выборка.АдресУТМ);
		ВозвращаемоеЗначение.Вставить("ПортУТМ",  Выборка.ПортУТМ);
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

&НаСервере
Процедура СохранитьНастройкиФормы()
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ПанельОбменСЕГАИС", "ОрганизацииЕГАИС", ОрганизацииЕГАИС);
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ПанельОбменСЕГАИС", "Ответственный",    Ответственный);
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройкиФормы()
	
	ОрганизацииЕГАИС = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ПанельОбменСЕГАИС", "ОрганизацииЕГАИС", ОрганизацииЕГАИС);
	Ответственный    = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ПанельОбменСЕГАИС", "Ответственный",    Ответственный);
	
	ИнтеграцияЕГАИС.ОтборПоОрганизацииПриСозданииНаСервере(ЭтотОбъект, "Отбор");
	
КонецПроцедуры

Процедура ДобавитьДокумент(Таблица, Метаданные, Заголовок, Оформите, Отработайте, Ожидайте)
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.Метаданные  = Метаданные;
	НоваяСтрока.Заголовок   = Заголовок;
	НоваяСтрока.Оформите    = Оформите;
	НоваяСтрока.Отработайте = Отработайте;
	НоваяСтрока.Ожидайте    = Ожидайте;
	
	НоваяСтрока.ЕстьПравоЧтение         = ПравоДоступа("Чтение", Метаданные);
	НоваяСтрока.ЕстьПравоДобавление     = ПравоДоступа("Добавление", Метаданные);
	НоваяСтрока.ЕстьПравоРедактирование = ПравоДоступа("Редактирование", Метаданные);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСпискиДокументов()
	
	ТаблицаДокументы = Новый ТаблицаЗначений;
	ТаблицаДокументы.Колонки.Добавить("Метаданные");
	ТаблицаДокументы.Колонки.Добавить("Заголовок");
	ТаблицаДокументы.Колонки.Добавить("Оформите");
	ТаблицаДокументы.Колонки.Добавить("Отработайте");
	ТаблицаДокументы.Колонки.Добавить("Ожидайте");
	ТаблицаДокументы.Колонки.Добавить("ЕстьПравоЧтение");
	ТаблицаДокументы.Колонки.Добавить("ЕстьПравоДобавление");
	ТаблицаДокументы.Колонки.Добавить("ЕстьПравоРедактирование");
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.ТТНВходящаяЕГАИС,
		НСтр("ru = 'Товарно-транспортные накладные ЕГАИС (входящие)'"),
		Ложь,    // Оформите
		Истина,  // Отработайте
		Истина); // Ожидайте
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.ТТНИсходящаяЕГАИС,
		НСтр("ru = 'Товарно-транспортные накладные ЕГАИС (исходящие)'"),
		Истина, Истина, Истина);
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.АктПостановкиНаБалансЕГАИС,
		НСтр("ru = 'Акты постановки на баланс ЕГАИС'"),
		Истина, Истина, Истина);
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.АктСписанияЕГАИС,
		НСтр("ru = 'Акты списания ЕГАИС'"),
		Истина, Истина, Истина);
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.ПередачаВРегистр2ЕГАИС,
		НСтр("ru = 'Передачи в регистр №2 ЕГАИС'"),
		Истина, Истина, Истина);
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.ВозвратИзРегистра2ЕГАИС,
		НСтр("ru = 'Возвраты из регистра №2 ЕГАИС'"),
		Ложь,    // Оформите
		Истина,  // Отработайте
		Истина); // Ожидайте
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.ОстаткиЕГАИС,
		НСтр("ru = 'Остатки ЕГАИС'"),
		Ложь,    // Оформите
		Истина,  // Отработайте
		Истина); // Ожидайте
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.ОтчетЕГАИС,
		НСтр("ru = 'Отчеты ЕГАИС'"),
		Ложь,    // Оформите
		Истина,  // Отработайте
		Истина); // Ожидайте
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.ЗапросАкцизныхМарокЕГАИС,
		НСтр("ru = 'Запросы акцизных марок ЕГАИС'"),
		Ложь,    // Оформите
		Истина,  // Отработайте
		Истина); // Ожидайте
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.ЧекЕГАИС,
		НСтр("ru = 'Чеки ЕГАИС'"),
		Истина, Истина, Истина);
	
	ДобавитьДокумент(
		ТаблицаДокументы,
		Метаданные.Документы.ЧекЕГАИСВозврат,
		НСтр("ru = 'Чеки ЕГАИС на возврат'"),
		Истина, Истина, Истина);
	
	ТекстыЗапроса = Новый СписокЗначений;
	
	ВсеТребующиеОжидания = Новый Массив;
	ВсеТребующиеДействия = Новый Массив;
	
	Для Каждого ТекЭлемент Из ТаблицаДокументы Цикл
		
		Если Не ТекЭлемент.ЕстьПравоЧтение Тогда
			Элементы["Группа" + ТекЭлемент.Метаданные.Имя].Видимость = Ложь;
			Продолжить;
		КонецЕсли;
		
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ТекЭлемент.Метаданные.ПолноеИмя());
		
		Для Каждого Элемент Из МенеджерОбъекта.ВсеТребующиеОжидания(Истина) Цикл
			Если ВсеТребующиеОжидания.Найти(Элемент) = Неопределено Тогда
				ВсеТребующиеОжидания.Добавить(Элемент);
			КонецЕсли;
		КонецЦикла;
		Для Каждого Элемент Из МенеджерОбъекта.ВсеТребующиеДействия(Истина) Цикл
			Если ВсеТребующиеДействия.Найти(Элемент) = Неопределено Тогда
				ВсеТребующиеДействия.Добавить(Элемент);
			КонецЕсли;
		КонецЦикла;
		
		Если ТекЭлемент.Оформите И ТекЭлемент.ЕстьПравоДобавление Тогда
			ТекстыЗапроса.Добавить(
				МенеджерОбъекта.ТекстЗапросаПанельОбменСЕГАИСОформите(),
				ТекЭлемент.Метаданные.Имя + "Оформите");
		КонецЕсли;
		
		Если ТекЭлемент.Отработайте И ТекЭлемент.ЕстьПравоРедактирование Тогда
			ТекстыЗапроса.Добавить(
				МенеджерОбъекта.ТекстЗапросаПанельОбменСЕГАИСОтработайте(),
				ТекЭлемент.Метаданные.Имя + "Отработайте");
		КонецЕсли;
		
		Если ТекЭлемент.Ожидайте Тогда
			ТекстыЗапроса.Добавить(
				МенеджерОбъекта.ТекстЗапросаПанельОбменСЕГАИСОжидайте(),
				ТекЭлемент.Метаданные.Имя + "Ожидайте");
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТекстыЗапроса.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("ОрганизацияЕГАИС",            ОрганизацииЕГАИС);
	ПараметрыЗапроса.Вставить("БезОтбораПоОрганизацииЕГАИС", ОрганизацииЕГАИС.Количество() = 0);
	ПараметрыЗапроса.Вставить("Ответственный",        ?(ЗначениеЗаполнено(Ответственный), Ответственный,    Неопределено));
	ПараметрыЗапроса.Вставить("ВсеТребующиеОжидания", ВсеТребующиеОжидания);
	ПараметрыЗапроса.Вставить("ВсеТребующиеДействия", ВсеТребующиеДействия);
	
	Запрос = Новый Запрос;
	Для Каждого ТекПараметр Из ПараметрыЗапроса Цикл
		Запрос.УстановитьПараметр(ТекПараметр.Ключ, ТекПараметр.Значение);
	КонецЦикла;
	
	РезультатыЗапроса = ИнтеграцияИС.ВыполнитьПакетЗапросов(Запрос, ТекстыЗапроса);
	
	Для ТекИндекс = 0 По ТаблицаДокументы.Количество() - 1 Цикл
		
		ТекЭлемент = ТаблицаДокументы[ТекИндекс];
		ИмяДокумента = ТекЭлемент.Метаданные.Имя;
		
		Если НЕ ТекЭлемент.ЕстьПравоЧтение Тогда
			Продолжить;
		КонецЕсли;
		
		ОбщееКоличество  = 0;
		ТоваровКПередаче = 0;
		
		ЕстьПередачаВРегистр2ЕГАИС = Ложь;
		
		Если ТекЭлемент.Оформите Тогда
			КнопкаОформите = Элементы["Открыть" + ИмяДокумента + "Оформите"];
			ПустаяОформите = Элементы["Открыть" + ИмяДокумента + "ОформитеДекорация"];
			ТекстОформите  = НСтр("ru = 'оформите'");
			
			Если ТекЭлемент.ЕстьПравоДобавление Тогда
				Если ТекЭлемент.Метаданные = Метаданные.Документы.ПередачаВРегистр2ЕГАИС Тогда
					
					ЕстьПередачаВРегистр2ЕГАИС = Истина;
					ТоваровКПередаче = ВывестиПоказатель(
						РезультатыЗапроса[ТекЭлемент.Метаданные.Имя + "Оформите"].Выбрать(), КнопкаОформите, ТекстОформите, Истина);
					
				ИначеЕсли ТекЭлемент.Метаданные = Метаданные.Документы.АктПостановкиНаБалансЕГАИС Тогда
					
					Выборка = РезультатыЗапроса[ТекЭлемент.Метаданные.Имя + "Оформите"].Выбрать();
					КоличествоДокументов = ?(Выборка.Следующий(), Выборка.КоличествоДокументов, 0);
					
					Если Цел(КоличествоДокументов) > 0 Тогда
						ОбщееКоличество = ОбщееКоличество + ВывестиПоказатель(Цел(КоличествоДокументов), КнопкаОформите, ТекстОформите);
					ИначеЕсли КоличествоДокументов > 0 Тогда
						ОбщееКоличество = ОбщееКоличество + ВывестиПоказатель(1, КнопкаОформите, ТекстОформите, Истина);
					Иначе
						ОбщееКоличество = ОбщееКоличество + ВывестиПоказатель(0, КнопкаОформите, ТекстОформите);
					КонецЕсли;
				
				Иначе
					
					ОбщееКоличество = ОбщееКоличество + ВывестиПоказатель(
					РезультатыЗапроса[ТекЭлемент.Метаданные.Имя + "Оформите"].Выбрать(), КнопкаОформите, ТекстОформите);
					
				КонецЕсли;
				
				ПустаяОформите.Видимость = Ложь;
			Иначе
				КнопкаОформите.Видимость = Ложь;
				ПустаяОформите.Видимость = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если ТекЭлемент.Отработайте Тогда
			КнопкаОтработайте = Элементы["Открыть" + ИмяДокумента + "Отработайте"];
			ПустаяОтработайте = Элементы["Открыть" + ИмяДокумента + "ОтработайтеДекорация"];
			ТекстОтработайте  = НСтр("ru = 'отработайте'");
			
			Если ТекЭлемент.ЕстьПравоРедактирование Тогда
				ОбщееКоличество = ОбщееКоличество + ВывестиПоказатель(
					РезультатыЗапроса[ТекЭлемент.Метаданные.Имя + "Отработайте"].Выбрать(), КнопкаОтработайте, ТекстОтработайте);
				
				ПустаяОтработайте.Видимость = Ложь;
			Иначе
				КнопкаОтработайте.Видимость = Ложь;
				ПустаяОтработайте.Видимость = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если ТекЭлемент.Ожидайте Тогда
			КнопкаОжидайте = Элементы["Открыть" + ИмяДокумента + "Ожидайте"];
			ТекстОжидайте  = НСтр("ru = 'ожидайте'");
			
			ОбщееКоличество = ОбщееКоличество + ВывестиПоказатель(
				РезультатыЗапроса[ТекЭлемент.Метаданные.Имя + "Ожидайте"].Выбрать(), КнопкаОжидайте, ТекстОжидайте);
		КонецЕсли;
		
		Если ЕстьПередачаВРегистр2ЕГАИС И ОбщееКоличество = 0 И ТоваровКПередаче > 0 Тогда
			ВывестиПоказатель(
				1,
				Элементы["Открыть" + ИмяДокумента],
				ТекЭлемент.Заголовок, Истина);
		Иначе
			ВывестиПоказатель(
				ОбщееКоличество,
				Элементы["Открыть" + ИмяДокумента],
				ТекЭлемент.Заголовок);
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЕСТЬNULL(КОЛИЧЕСТВО (РАЗЛИЧНЫЕ ОчередьПередачиДанныхЕГАИС.Сообщение), 0) КАК КоличествоСообщений
	|ИЗ
	|	РегистрСведений.ОчередьПередачиДанныхЕГАИС КАК ОчередьПередачиДанныхЕГАИС
	|ГДЕ
	|	ОчередьПередачиДанныхЕГАИС.ОрганизацияЕГАИС В(&ОрганизацияЕГАИС)
	|	ИЛИ &БезОтбораПоОрганизацииЕГАИС
	|");
	Запрос.УстановитьПараметр("ОрганизацияЕГАИС",            ОрганизацииЕГАИС);
	Запрос.УстановитьПараметр("БезОтбораПоОрганизацииЕГАИС", ОрганизацииЕГАИС.Количество() = 0);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() И Выборка.КоличествоСообщений > 0 Тогда
		ТекстЗаголовка = СтрШаблон(НСтр("ru = 'Есть сообщения (%1), ожидающие отправки в ЕГАИС. Выполните обмен.'"), Выборка.КоличествоСообщений);
		Элементы.НадписьСообщенияОжидающиеОтправки.Заголовок   = ТекстЗаголовка;
		Элементы.ДекорацияСообщенияОжидающиеОтправки.Видимость = Истина;
		Элементы.НадписьСообщенияОжидающиеОтправки.Видимость   = Истина;
	Иначе
		Элементы.ДекорацияСообщенияОжидающиеОтправки.Видимость = Ложь;
		Элементы.НадписьСообщенияОжидающиеОтправки.Видимость   = Ложь;
	КонецЕсли;
	
	СохранитьНастройкиФормы();
	
КонецПроцедуры

&НаСервере
Функция ВывестиПоказатель(Выборка, Кнопка, ТекстПоказателя, БезКоличества = Ложь)
	
	Если ТипЗнч(Выборка) = Тип("Число") Тогда
		КоличествоДокументов = Выборка;
	Иначе
		КоличествоДокументов = ?(Выборка.Следующий(), Выборка.КоличествоДокументов, 0);
	КонецЕсли;
	
	Если КоличествоДокументов > 0 Тогда
		Если БезКоличества Тогда
			ТекстЗаголовка = ТекстПоказателя;
		Иначе
			ТекстЗаголовка = ТекстПоказателя + " (" + КоличествоДокументов + ")";
		КонецЕсли;
		ЦветТекста = ЦветаСтиля.ЦветГиперссылкиГосИС;
	Иначе
		ТекстЗаголовка = ТекстПоказателя;
		ЦветТекста = ЦветаСтиля.ЦветТекстаНеТребуетВниманияГосИС;
	КонецЕсли;
	
	Кнопка.Заголовок = ТекстЗаголовка;
	Кнопка.ЦветТекста = ЦветТекста;
	Кнопка.Видимость = Истина;
	
	Возврат КоличествоДокументов;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуСпискаДокументов(ИмяФормы,
	                                   ДальнейшееДействиеЕГАИС = Неопределено,
	                                   ОткрытьРаспоряжения = Ложь,
	                                   ИмяПоляОтветственный = Неопределено,
	                                   ИмяПоляОрганизация = Неопределено)
	
	СтруктураБыстрогоОтбора = Новый Структура();
	ПараметрыФормы = Новый Структура;
	
	Если ОткрытьРаспоряжения Тогда
		ПараметрыФормы.Вставить("ОткрытьРаспоряжения", Истина);
	ИначеЕсли ДальнейшееДействиеЕГАИС <> Неопределено Тогда
		СтруктураБыстрогоОтбора.Вставить("ДальнейшееДействиеЕГАИС", ДальнейшееДействиеЕГАИС);
	КонецЕсли;
	
	Если ИмяПоляОтветственный = Неопределено Тогда
		ИмяПоляОтветственный = "Ответственный";
	КонецЕсли;
	
	Если ИмяПоляОрганизация = Неопределено Тогда
		ИмяПоляОрганизация = "ОрганизацияЕГАИС";
	КонецЕсли;
	
	СтруктураБыстрогоОтбора.Вставить(ИмяПоляОтветственный, Ответственный);
	СтруктураБыстрогоОтбора.Вставить(ИмяПоляОрганизация,   ОрганизацииЕГАИС);
	
	ПараметрыФормы.Вставить("СтруктураБыстрогоОтбора", СтруктураБыстрогоОтбора);
	ОткрытьФорму(ИмяФормы, ПараметрыФормы,,,,,);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораОрганизацииЕГАИС(Результат, ДополнительныеПараметры) Экспорт
	
	ОбновитьСпискиДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОткрытьWebИнтерфейсУТМ(ВыбраннаяОрганизацияЕГАИС)
	
	ПараметрыУТМ = АдресИПортУТМ(ВыбраннаяОрганизацияЕГАИС);
	Если ПараметрыУТМ <> Неопределено Тогда
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(
			"http://" + ПараметрыУТМ.АдресУТМ + ":" + Формат(ПараметрыУТМ.ПортУТМ, "ЧГ=0") + "/",
			Новый ОписаниеОповещения("ПослеОткрытияWebИнтерфейсаУТМ", ЭтотОбъект));
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрШаблон(
				НСтр("ru = 'Не заданы параметры подключения к УТМ для организации ЕГАИС %1'"), ВыбраннаяОрганизацияЕГАИС),,
			"ОрганизацияЕГАИС");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборОрганизацииЕГАИСДляОткрытияWebИнтерфейсаУТМ(ВыбраннаяОрганизацияЕГАИС, ДополнительныеПараметры) Экспорт
	
	Если ВыбраннаяОрганизацияЕГАИС = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьОткрытьWebИнтерфейсУТМ(ВыбраннаяОрганизацияЕГАИС.Значение);
	
КонецПроцедуры

#КонецОбласти
